
import java.io.*;
import java.util.*;

public class L7 {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);

        // Вводятся целые числа, ввод заканчивается нулем.
        // Вывести сумму всех простых чисел среди них

        // Вводятся целые числа, ввод заканчивается нулем.
        // Строится последовательность Collatz:
        // - n/2, если n - чётное
        // - 3*n+1, если n - нечётное
        // Последовательность заканчивается 1
        // Вывести число, которое выдаст самую длинную последовательность (больше всего членов до 1)
    }
}
