import java.io.*;
import java.util.*;

public class L10 {
  public static void main(String[] args) {
    // Игра "Жизнь" - https://ru.wikipedia.org/wiki/%D0%98%D0%B3%D1%80%D0%B0_%C2%AB%D0%96%D0%B8%D0%B7%D0%BD%D1%8C%C2%BB
    // Поле 20x20, соседняя клетка - по горизонтали, вертикали или диагонали
    // Клетки либо живые, либо мертвые
    // У живой клетки >3 соседей - она погибает от перенаселения, <2 - от одиночества
    // У мертвой клетки 3 живых соседа - она рождается
    // Вводится начальное состояние поля
    // Промоделировать один шаг
    // Вывести, что получится


  }
}
